#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.KEYCLOAK_TEST.module.moh_applications.module.CGI-DEVELOPER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/ba2aead8-cd2d-4519-991b-3bd44c71c057]
module.KEYCLOAK_TEST.module.moh_applications.module.CGI-MIDTIER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/782fe94e-79a2-438f-9bc1-28717395b28d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-WAVA.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "PLR-WAVA"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Client for use in performing a PLR WAVA scan"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "PLR WAVA Scan"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-WAVA.keycloak_openid_hardcoded_claim_protocol_mapper.orgId will be created
  + resource "keycloak_openid_hardcoded_claim_protocol_mapper" "orgId" {
      + add_to_access_token = true
      + add_to_id_token     = true
      + add_to_userinfo     = true
      + claim_name          = "orgId"
      + claim_value         = "00002855"
      + claim_value_type    = "String"
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "orgId"
      + realm_id            = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-WAVA.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_REV/CONSUMER"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "d3dc70e8-af0e-4cb9-9e79-3706c94fd8da"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-WAVA.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_REV/PRIMARY_SOURCE"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "4b919d71-c76b-4621-be50-f05a7e8ed144"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-WAVA.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["default-roles-moh_applications"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "default-roles-moh_applications"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-WAVA.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_REV/CONSUMER"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "20e896f4-bf43-43ed-9441-d166e0513f34"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "CONSUMER"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-WAVA.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_REV/PRIMARY_SOURCE"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "20e896f4-bf43-43ed-9441-d166e0513f34"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "PRIMARY_SOURCE"
      + service_account_user_id = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @daveb-hni, Action: `pull_request`*